const CoursesList = [
    {   
        id: 0,
        name: "Основы Python",
        level: "начинающий",
        rating: "4.6",
        description: "Отличное введение в мир программирования для тех, кто только начинает свой путь в этой области. Python - мощный инструмент с простым и понятным синтаксисом, и этот курс поможет вам освоить его базовые концепции и возможности. Независимо от вашего уровня подготовки, вы сможете легко усвоить материал благодаря понятным объяснениям и практическим заданиям. После завершения курса вы будете готовы к более продвинутым темам и проектам в области программирования на Python.",
        user_quantity: "57",
        reviews: "",
        blocks: "3",
        tasks: "12",
        exams: "2",
    },
    {
        id: 1,
        name: "JavaScript ULTRA",
        level: "совершенный",
        rating: "5.0",
        description: "Предназначен для тех, кто уже обладает продвинутыми знаниями и опытом в JavaScript и стремится к совершенствованию своих навыков. В рамках этого курса студенты углубят свои знания в основные концепции языка, такие как замыкания, прототипы, асинхронное программирование и многие другие. Курс также включает в себя изучение продвинутых тем, таких как функциональное программирование, работы с API, оптимизация производительности и разработка масштабируемых приложений. После завершения этого курса студенты будут готовы к решению сложных задач и разработке профессиональных веб-приложений на JavaScript.",
        user_quantity: "7",
    },
    {
        id: 2,
        name: "Программирование на С++",
        level: "продвинутый",
        rating: "2.9",
        description: "Предназначен для опытных разработчиков, которые уже овладели основами языка C++ и хотят расширить свои знания и навыки в этой области. В рамках этого курса студенты изучат продвинутые темы, такие как шаблоны, многопоточное программирование, работу с указателями, стандартные библиотеки, оптимизацию кода и многое другое. Курс также включает в себя изучение передовых методов разработки, таких как разработка высокопроизводительных приложений, создание игр и использование C++ во встраиваемых системах. После завершения этого курса студенты будут готовы к разработке сложных и эффективных приложений на C++.",
        user_quantity: "452",
    },
]

export {CoursesList};